<template>
  <div>
    <el-select v-model="value" placeholder="请选择国家">
      <el-option v-for="item in country" :key="item.value" :value="item.value"></el-option>
    </el-select>
  </div>
</template>

<script>
export default {
  name: '',
  data() {
    return {
      options: [
        {
          value: '选项1'
        },
        {
          value: '选项5'
        }
      ],
      value: ''
    }
  },
  computed: {
    country: function() {
      let str =
        '中国、蒙古、朝鲜、韩国、日本、菲律宾、越南、老挝、柬埔寨、缅甸、泰国、马来西亚、文莱、新加坡、印度尼西亚、东帝汶、尼泊尔、不丹、孟加拉国、印度、巴基斯坦、斯里兰卡、马尔代夫、哈萨克斯坦、吉尔吉斯斯坦、塔吉克斯坦、乌兹别克斯坦、土库曼斯坦、阿富汗、伊拉克、伊朗、叙利亚、约旦、黎巴嫩、以色列、巴勒斯坦、沙特阿拉伯、巴林、卡塔尔、科威特、阿拉伯联合酋长国、阿曼、也门、格鲁吉亚、亚美尼亚、阿塞拜疆、土耳其、塞浦路斯、芬兰、瑞典、挪威、冰岛、丹麦 、法罗群岛（丹）、爱沙尼亚、拉脱维亚、立陶宛、摩尔多瓦、白俄罗斯、俄罗斯、乌克兰、波兰、捷克、斯洛伐克、匈牙利、德国、奥地利、瑞士、列支敦士登、英国、爱尔兰、荷兰、比利时、卢森堡、法国、摩纳哥、罗马尼亚、保加利亚、塞尔维亚、马其顿、斯洛文尼亚、克罗地亚、黑山、波斯尼亚和黑塞哥维那、阿尔巴尼亚、希腊、意大利、马耳他、梵蒂冈、圣马力诺、西班牙、葡萄牙、安道尔、直布罗陀、埃及、利比亚、突尼斯、阿尔及利亚、摩洛哥、亚速尔群岛（葡）、马德拉群岛（葡）、加那利群岛（西）、苏丹、南苏丹、埃塞俄比亚、厄立特里亚、索马里、吉布提、肯尼亚、坦桑尼亚、乌干达、卢旺达、布隆迪、塞舌尔、乍得、中非、喀麦隆、赤道几内亚、加蓬、刚果共和国、刚果民主共和国、圣多美和普林西比、毛里塔尼亚、塞内加尔、冈比亚、马里、布基纳法索、几内亚、几内亚比绍、佛得角、塞拉利昂、利比里亚、科特迪瓦、加纳、多哥、贝宁、尼日尔、尼日利亚 、西撒哈拉、赞比亚、安哥拉、津巴布韦、马拉维、莫桑比克、博茨瓦纳、纳米比亚、南非、斯威士兰、莱索托、马达加斯加、科摩罗、毛里求斯、留尼汪岛（法）、圣赫勒拿岛（英）、马约特（法）、加拿大、美国、墨西哥、格陵兰（丹）、圣皮埃尔和密克隆（法）、百慕大（英）、危地马拉、伯利兹、萨尔瓦多、洪都拉斯、尼加拉瓜、哥斯达黎加、巴拿马、巴哈马、古巴、牙买加、海地、多米尼加、安提瓜和巴布达、圣基茨和尼维斯、多米尼克、圣卢西亚、圣文森特和格林纳丁斯、格林纳达、巴巴多斯、特立尼达和多巴哥、波多黎各（美）、英属维尔京群岛、美属维尔京群岛、安圭拉（英）、蒙特塞拉特（英）、瓜德罗普（法）、马提尼克（法）、阿鲁巴（荷）、荷属圣马丁、法属圣马丁、圣巴泰勒米岛（法）、特克斯和凯科斯群岛（英）、开曼群岛（英）、库拉索（荷）、哥伦比亚、委内瑞拉、圭亚那、苏里南、法属圭亚那、厄瓜多尔、秘鲁、玻利维亚、巴西、智利、阿根廷、乌拉圭、巴拉圭、马尔维纳斯群岛、澳大利亚、新西兰、帕劳、密克罗尼西亚联邦、马绍尔群岛、基里巴斯、瑙鲁、北马里亚纳（美）、关岛（美）、巴布亚新几内亚、所罗门群岛、瓦努阿图、斐济群岛、新喀里多尼亚（法）、图瓦卢、萨摩亚、汤加、库克群岛、纽埃、托克劳（新）、法属波利尼西亚、瓦利斯和富图纳（法）、皮特凯恩群岛（英）、美属萨摩亚'
      let arr = str.split('、')
      let obj = {}
      let country = arr.map(item => {
        let symbol = '"'
        let strArr = '{"value":' + symbol + item + symbol + '}'
        return JSON.parse(strArr)
      })
      return country
    }
  }
}
</script>
<style scoped>
</style>
